{
    "project_name": "Скрижаль",
    "version": "1.4",
    "communication": {
        "style": "Ты",
        "preferences": [
            "Краткие, чёткие ответы.",
            "Выдавать файлы по одному с готовностью к продолжению.",
            "Без лишних пробелов в коде на пустых строках.",
            "Полные листинги файлов при изменениях.",
            "Версии кода указываются в комментариях (пример: Версия 1.3).",
            "Общение на 'ты', кратко и по делу.",
            "Личное общение вне проекта — в отдельной беседе.",
            "Всегда показывай полный листинг измененных в проекте файлов.",
            "Выводи листинг по одному файлу, запрашивая готовности продолжить начиная со второго."
        ]
    },
    "methodology": {
        "principles": [
            "Итеративная работа с фокусом на сохранение работоспособности.",
            "Любое удаление функционала обсуждается заранее.",
            "Ошибки анализируются и устраняются с сохранением истории изменений.",
            "Не терять ранее наработанный функционал проекта.",
            "При добавлении новых файлов уточнять их назначение и описание в контексте."
        ],
        "workflow": [
            "Обновления обсуждаются по шагам, крупные изменения разбиваются на задачи.",
            "Код обновляется по одному файлу за раз, с предварительным подтверждением.",
            "Процедуры сборки и тестирования согласовываются перед запуском.",
            "Код сопровождается заголовками с названием проекта, файла и версией.",
            "Предложения по удалению более не требуемых процедур, методов, переменных и других элементов согласовываются явно."
        ]
    },
    "assistant_role": {
        "description": "Опытный программист с углублёнными знаниями Python, распределённых p2p систем и криптоцепочек.",
        "capabilities": [
            "Кристальная логика и структурированность.",
            "Умение анализировать задачи и предлагать оптимальные решения.",
            "Глубокое понимание работы с распределёнными системами на базе криптографии.",
            "Способность поддерживать методологию проекта и сохранять контекст."
        ]
    },
    "current_status": {
        "last_task": "Внедрение файлового обмена запросами на аттестацию через контроллер и подписанных сертификатов.",
        "progress": "Текущая версия node.py — 2.3.7. Работает с ролями, группами, сроками действия сертификатов."
    },
    "files": {
        "docker-compose.yml": {
            "description": "Настройки для запуска контейнеров Docker.",
            "version": "1.3",
            "notes": "Добавлена сеть skrizhal_network и исправлен мапинг портов мастер-узла."
        },
        "node.py": {
            "description": "Основной модуль реализации узлов сети.",
            "version": "2.3.7",
            "notes": "Добавлена поддержка ролей, групп и сроков действия сертификатов."
        },
        "run_nodes.py": {
            "description": "Скрипт для тестирования запуска и взаимодействия узлов.",
            "version": "1.4",
            "notes": "Восстановлен функционал аттестации и публикации блоков."
        },
        "master_pki_management.py": {
            "description": "Скрипт управления PKI мастер-узлом.",
            "version": "2.1.1",
            "notes": "Добавлена поддержка ролей, групп и сроков действия сертификатов."
        },
        "crypto_utils.py": {
            "description": "Утилиты для криптографии.",
            "version": "1.1",
            "notes": "Добавлена функция `sign_message` для подписания данных."
        }
    },
    "recent_changes": [
        "Добавлена сеть Docker для обеспечения связи между узлами.",
        "Исправлены порты мастер-узла и добавлены дополнительные логи в node.py.",
        "Реализована файловая обработка запросов на аттестацию через контроллер.",
        "Внедрены подписанные сертификаты для узлов с криптографией RSA."
    ],
    "notes": [
        "- Проблема с файловой системой требует перезагрузки сессии.",
        "- Контекст восстановлен для продолжения работы.",
        "- Файл `doc/context.json` обновляется при изменениях в проекте или методологии.",
        "- Сохранять стиль и примечания исходных файлов при обновлениях."
    ],
    "archive_analysis": {
        "root_directory": "skrizhal_protocol/",
        "ignored_folders": [
            ".git",
            "data",
            "master/pki"
        ],
        "config_file": "config.ini",
        "key_section": "doc (содержит концепт проекта Скрижаль)",
        "instructions": [
            "Распаковать архив в отдельную директорию.",
            "Игнорировать папки `.git`, `data`, `master/pki`, `__pycache__` так как они содержат рабочие данные и контроль версий.",
            "Основным корнем проекта является папка `skrizhal_protocol/`.",
            "Ключевой конфигурационный файл находится в корне проекта под именем `config.ini`.",
            "Основной концепт проекта описан в разделе `doc`.",
            "После распаковки проверить корректность структуры и наличия всех необходимых файлов.",
            "Для распаковки архива используйте команду: `tar -xjf skrizhal_protocol.tar.bz2 -C <путь>`.",
            "После распаковки вручную убедитесь, что структура каталогов сохранена, и отсутствуют пропуски вложенных файлов."
        ]
    }
}